zuohan88/stm32g0-bootloader/G070KB_IAP_2.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G0
SH.GPXTI10.0=GPIO_EXTI10
ProjectManager.MainLocation=Core/Src
RCC.USART1Freq_Value=1000000
USART2.RXFIFOThreshold=RXFIFO_THRESHOLD_1EIGHTHFULL
ProjectManager.ProjectFileName=G070KB_IAP_2.ioc
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate,WordLength,Parity,StopBits,FIFOMode,RXFIFOThreshold
RCC.CortexFreq_Value=1000000
ProjectManager.KeepUserCode=true
PA15.GPIOParameters=PinState,GPIO_Label
Mcu.UserName=STM32G070KBTx
Mcu.PinsNb=13
ProjectManager.NoMain=false
PA11\ [PA9].GPIO_Label=INVALID
USART1.BaudRate=9600
PA12\ [PA10].GPIO_Label=FORCEON
USART1.WordLength=WORDLENGTH_8B
USART2.Parity=PARITY_NONE
PA14-BOOT0.Mode=Serial_Wire
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USART1_UART_Init-USART1-false-HAL-true,4-MX_USART2_UART_Init-USART2-false-HAL-true,5-MX_CRC_Init-CRC-false-HAL-true
RCC.EXTERNAL_CLOCK_VALUE=48000
ProjectManager.DefaultFWLocation=true
RCC.USART2Freq_Value=1000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate,WordLength,Parity,StopBits
USART2.BaudRate=9600
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
CRC.IPParameters=DefaultInitValueUse,DefaultPolynomialUse,CRCLength
RCC.MCO1PinFreq_Value=1000000
ProjectManager.StackSize=0x400
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA3.Mode=Asynchronous
PA13.Signal=SYS_SWDIO
Mcu.IP4=USART1
RCC.FCLKCortexFreq_Value=1000000
Mcu.IP5=USART2
CRC.DefaultPolynomialUse=DEFAULT_POLYNOMIAL_DISABLE
Mcu.IP2=RCC
Mcu.IP3=SYS
PA15.GPIO_Label=FORCEOFF
Mcu.IP0=CRC
Mcu.IP1=NVIC
PA15.Locked=true
USART1.StopBits=STOPBITS_1
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
Mcu.ThirdPartyNb=0
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
RCC.HCLKFreq_Value=1000000
PA12\ [PA10].Signal=GPIO_Output
Mcu.IPNb=6
ProjectManager.PreviousToolchain=
USART1.Parity=PARITY_NONE
PB6.Signal=USART1_TX
RCC.I2S1Freq_Value=1000000
PB6.Mode=Asynchronous
Mcu.Pin6=PA14-BOOT0
Mcu.Pin7=PA15
ProjectManager.RegisterCallBack=
Mcu.Pin8=PB6
Mcu.Pin9=PB7
PA11\ [PA9].Locked=true
RCC.LSE_VALUE=32768
RCC.AHBFreq_Value=1000000
Mcu.Pin0=PA2
Mcu.Pin1=PA3
PA14-BOOT0.Signal=SYS_SWCLK
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA10
Mcu.Pin3=PA11 [PA9]
Mcu.Pin4=PA12 [PA10]
Mcu.Pin5=PA13
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
PA11\ [PA9].GPIOParameters=GPIO_Label
board=custom
USART2.VirtualMode-Asynchronous=VM_ASYNC
RCC.VCOOutputFreq_Value=128000000
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
PA12\ [PA10].GPIOParameters=PinState,GPIO_Label
ProjectManager.FirmwarePackage=STM32Cube FW_G0 V1.4.1
PA15.PinState=GPIO_PIN_RESET
MxDb.Version=DB.6.0.21
USART2.StopBits=STOPBITS_1
ProjectManager.BackupPrevious=false
MxCube.Version=6.2.1
RCC.VCOInputFreq_Value=16000000
RCC.I2C1Freq_Value=1000000
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
RCC.ADCFreq_Value=1000000
File.Version=6
PA10.GPIO_Label=READY
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
PB7.Signal=USART1_RX
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLLRCLKFreq_Value=64000000
SH.GPXTI11.ConfNb=1
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APBFreq_Value,APBTimFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSISYSCLKDivider,HSI_VALUE,I2C1Freq_Value,I2S1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLPoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,SYSCLKFreq_VALUE,USART1Freq_Value,USART2Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G070KBTx
PA11\ [PA9].Signal=GPXTI11
ProjectManager.HalAssertFull=false
PA2.Signal=USART2_TX
ProjectManager.ProjectName=G070KB_IAP_2
ProjectManager.UnderRoot=true
USART2.FIFOMode=FIFOMODE_DISABLE
ProjectManager.CoupleFile=false
RCC.APBTimFreq_Value=1000000
RCC.SYSCLKFreq_VALUE=1000000
Mcu.Package=LQFP32
SH.GPXTI11.0=GPIO_EXTI11
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
RCC.APBFreq_Value=1000000
CRC.DefaultInitValueUse=DEFAULT_INIT_VALUE_DISABLE
PA12\ [PA10].PinState=GPIO_PIN_RESET
PA13.Locked=true
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB7.Mode=Asynchronous
RCC.LSCOPinFreq_Value=32000
PA10.Signal=GPXTI10
PA15.Signal=GPIO_Output
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA12\ [PA10].Locked=true
USART2.WordLength=WORDLENGTH_8B
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
Mcu.Pin11=VP_SYS_VS_Systick
Mcu.Pin12=VP_SYS_VS_DBSignals
RCC.PLLPoutputFreq_Value=64000000
Mcu.Pin10=VP_CRC_VS_CRC
SH.GPXTI10.ConfNb=1
PB7.Locked=true
PA2.Mode=Asynchronous
RCC.PWRFreq_Value=1000000
VP_CRC_VS_CRC.Mode=CRC_Activate
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32G070KBTx
RCC.HSISYSCLKDivider=RCC_HSI_DIV16
ProjectManager.LibraryCopy=1
PA3.Signal=USART2_RX
CRC.CRCLength=CRC_POLYLENGTH_16B
isbadioc=false
